20180824_testCube_successfull/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 1.568e-05; 		//air kinematic viscosity
//gammaW          [0 2 -1 0 0 0 0] 1e-06;		//fake diffusivity --> leave it off
dw              [0 1 0 0 0 0 0] 150e-06;		//water droplet diameter
nuw             [0 2 -1 0 0 0 0] 8.9178e-07;		//water kinematic viscosity


// ************************************************************************* //
