20180824_testCube_successfull/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


//windTunnel advanced geometry

convertToMeters 1;

vertices
(

	(-0.5 -0.5 -0.5) //0
	(1.5 -0.5 -0.5) //1
	(1.5 1.5 -0.5) //2
	(-0.5 1.5 -0.5) //3

	(-0.5 -0.5 1.5) //0
	(1.5 -0.5 1.5) //1
	(1.5 1.5 1.5) //2
	(-0.5 1.5 1.5) //3


);
////////////////////////////////////////////////////////////////////////////////////////
blocks
(
	hex (0 1 2 3 4 5 6 7) (33 33 33) simpleGrading (1 1 1) // 3 cm --> ok
	
);

edges
(
);

boundary

(
	in //0
	{
		type patch;
		faces
		(
		(0 3 4 7)
		);
	}
	shell //1
	{
		type wall;
		faces
		(
		(0 1 5 4)
		(3 7 6 2)
		(3 2 1 0)
		(4 5 6 7)
		);
	}

	out //5
	{
		type patch;
		faces
		(
		(1 2 6 5)
		);
	}
);

mergePairs
(
);





// ************************************************************************* //
