20180824_testCube_successfull/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleDiffFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.25;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           20;

////////////////////////////////////////////////////////////////////////////////
//function
//{

//#includeFunc "flowRatePatch"

//surfaceFieldValue1
//{
//    type            surfaceFieldValue;
//    libs            ("libfieldFunctionObjects.so");
//    fields          (U p W);
//    writeFields     no; // yes | no
    //regionType      <region type>;
//    operation       surfaceIntegrate;




    // Optional entries

    // Scale factor
//    scaleFactor     1;

    // List of oriented fields
    //orientedFields  (<field names>);

    // Weight field - must be a scalar
    //weightField     phi;

    // Write the total area of the faces
    //writeArea       yes;
//}

//} // --> END FUNCTION


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
